In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("D:/Datasets/simple_data.csv")

In [3]:
df.head()

   sirano     isim  yas       meslek     sehir  aylik_gelir
0       1    Cemal   35         Isci    Ankara         3500
1       2    Ceyda   42        Memur   Kayseri         4200
2       3    Timur   30     Müzisyen  Istanbul         9000
3       4    Burcu   29  Pazarlamaci    Ankara         4200
4       5  Yasemin   23          NaN     Bursa         4800

# Tek Bir Nümerik Nitelik Üzerinde, Birden Çok Niteliği Gruplama ve Kümeleme

# agg() fonksiyonu format-1

    dataframe.groupby([gruplanacak_kategorik_nitelik1, gruplanacak_kategorik_nitelik2, ..]) \
    .kümelenecek_nümerik_nitelik \
    .agg(['kümeleme_fonk1','kümeleme_fonk2',...]) \
    .head()

<h1 style="color:red";> !!!!!!! Sonucun dataframe olması için hem groupby() hem de agg() içine nitelikleri liste içinde vermeyi unutmayınız !!!!!!!</h1>

In [15]:
# mesleklere göre ortalama gelir
meslek_grpby = df.groupby(["meslek"]).aylik_gelir \
.agg(['mean'])

In [16]:
meslek_grpby.head(10)

                     mean
meslek
Berber        9866.666667
Doktor       16125.000000
Isci          3500.000000
Memur         4066.666667
Müzisyen     10500.000000
Pazarlamaci   5750.000000
Tornacı       4200.000000
Tuhafiyeci    4800.000000

In [8]:
meslek_grpby.columns

Index(['mean'], dtype='object')

In [10]:
meslek_grpby.index

Index(['Berber', 'Doktor', 'Isci', 'Memur', 'Müzisyen', 'Pazarlamaci',
       'Tornacı', 'Tuhafiyeci'],
      dtype='object', name='meslek')

# indeks kullanarak yeni bir sütun yaratılabilir

In [17]:
# Bunun için reset_index() kullanmak yeterlidir.
meslek_grpby.reset_index(inplace=True)
meslek_grpby.head()

     meslek          mean
0    Berber   9866.666667
1    Doktor  16125.000000
2      Isci   3500.000000
3     Memur   4066.666667
4  Müzisyen  10500.000000

In [18]:
meslek_grpby.columns

Index(['meslek', 'mean'], dtype='object')

# Meslekleri ortalama kazançlarına göre sıralama

In [19]:
df.groupby(["meslek"]).aylik_gelir \
.agg(['mean']) \
.sort_values('mean', ascending=False)

                     mean
meslek
Doktor       16125.000000
Müzisyen     10500.000000
Berber        9866.666667
Pazarlamaci   5750.000000
Tuhafiyeci    4800.000000
Tornacı       4200.000000
Memur         4066.666667
Isci          3500.000000

# Birden fazla niteliği gruplama ve birden fazla nitelik üzerinde kümeleme fonksiyonu çalıştırma

In [20]:
df.groupby(["meslek","sehir"]).aylik_gelir \
.agg(['count','mean','sum']) \
.sort_values("mean", ascending=False) \
.head()

                   count   mean    sum
meslek   sehir
Doktor   Ankara        1  18000  18000
         İzmir         1  14250  14250
Berber   Istanbul      1  12000  12000
Müzisyen Istanbul      2  10500  21000
Berber   Ankara        2   8800  17600

# Birden fazla sıralama nasıl olur?

In [21]:
df.sort_values(["yas","aylik_gelir"], ascending=[False,True]) \
.head(10)

    sirano      isim  yas      meslek     sehir  aylik_gelir
10      11  Hicaziye   47  Tuhafiyeci    Ankara         4800
15      16    Gençay   46      Berber    Ankara         8800
16      16    Gençay   46      Berber    Ankara         8800
9       10  Muhittin   46      Berber  Istanbul        12000
11      12     Harun   43     Tornacı    Ankara         4200
1        2     Ceyda   42       Memur   Kayseri         4200
14      15    Şehmuz   41         NaN    Ankara         8700
13      14   Gülizar   37      Doktor     İzmir        14250
0        1     Cemal   35        Isci    Ankara         3500
12      13     Hakkı   33       Memur     Çorum         3750

In [14]:
# 46 yaşındaki Berberlerin gelirleri de artan sıralı oldu.

# Birden Fazla Nümerik Değer Üzerinde groupby()

In [22]:
df_meslek_sehir = df.groupby(["meslek","sehir"])[["yas","aylik_gelir"]] \
                    .agg(["mean","count"]) \
                    .reset_index()
df_meslek_sehir.head()

   meslek     sehir   yas       aylik_gelir
                     mean count        mean count
0  Berber    Ankara  46.0     2        8800     2
1  Berber  Istanbul  46.0     1       12000     1
2  Doktor    Ankara  33.0     1       18000     1
3  Doktor     İzmir  37.0     1       14250     1
4    Isci    Ankara  35.0     1        3500     1

# ÇokluSütun indeksinde sıralama (MultiIndex)

In [23]:
df_meslek_sehir \
.sort_values([('aylik_gelir','mean')], ascending=False) \
.head()

     meslek     sehir   yas       aylik_gelir
                       mean count        mean count
2    Doktor    Ankara  33.0     1       18000     1
3    Doktor     İzmir  37.0     1       14250     1
1    Berber  Istanbul  46.0     1       12000     1
8  Müzisyen  Istanbul  30.5     2       10500     2
0    Berber    Ankara  46.0     2        8800     2

# 02_pandas: alıştırma - 3

In [ ]:
# tips.csv dosyasını okuyarak 
# günlere göre toplam ve ortalama tip, total_bill hesaplayınız. 
# Sonuçları bahşiş ortalamasına göre azalan sıralayınız.